export const TEST_MATH_STRING = String.raw`集合$G$が半群であるとは，$G$上に演算$\cdot$が定義されていて，任意の$x, y \in G$に対して，$x\cdot y \in G$が成り立つことをいう。また，集合$G$が半群であって，ある$e\in G$が存在して，任意の$x\in G$に対して$ex = xe = x$を満たすとき$G$はモノイドであるという。

集合$G$が半群であるとは，$G$上に演算$\cdot$が定義されていて，任意の$x, y \in G$に対して，$x\cdot y \in G$が成り立つことをいう。また，集合$G$が半群であって，ある$e\in G$が存在して，任意の$x\in G$に対して$ex = xe = x$を満たすとき$G$はモノイドであるという。

集合$G$が半群であるとは，$G$上に演算$\cdot$が定義されていて，任意の$x, y \in G$に対して，$x\cdot y \in G$が成り立つことをいう。また，集合$G$が半群であって，ある$e\in G$が存在して，任意の$x\in G$に対して$ex = xe = x$を満たすとき$G$はモノイドであるという。`;
